Картриджи/src/Documents/СпросНаКартриджи/СпросНаКартриджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпросНаКартриджи</name>
  <registerRecords>InformationRegister.СпросКартриджей</registerRecords>
  <attributes>
    <name>Подазделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнен</name>
    <type>
      <types>EnumRef.ИсполнениеСпросов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Картриджи</name>
    <attributes>
      <name>МодельКартриджа</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производители</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/Enums/ИсполнениеСпросов/ИсполнениеСпросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсполнениеСпросов</name>
  <enumValues>
    <name>НеВыполнено</name>
  </enumValues>
  <enumValues>
    <name>ВыполненоЧастично</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
</mdclass:Enum>

Картриджи/src/Documents/СпросНаКартриджи/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КартриджиМодельКартриджаПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.МодельКартриджа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(МодельКартриджа)

	Возврат МодельКартриджа.Производитель;

КонецФункции // ПолучитьПроизводителя()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Выставляем дату
	Если Объект.Дата = НачалоДня(ТекущаяДата()) ТОгда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	//Ставим статус документа
	Если Объект.Исполнен = ПредопределенноеЗначение("Перечисление.ИсполнениеСпросов.ПустаяСсылка") Тогда
		Объект.Исполнен = ПредопределенноеЗначение("Перечисление.ИсполнениеСпросов.НеВыполнено");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьИнтерфейс();
КонецПроцедуры
